IDENTIFICATION DIVISION.
PROGRAM-ID. MAL-STEP0.
AUTHOR. WAYNE MYERS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PROMPT-MSG PIC X(6) VALUE 'user> '.
01 WS-QUIT PIC 9(1) VALUE 0.
01 WS-INPUT PIC X(1).

PROCEDURE DIVISION.
*> Main program loop
     PERFORM REPL-PARA UNTIL WS-QUIT = 1.
STOP RUN.

REPL-PARA.
*> Perform the READ/EVAL/PRINT loop
     PERFORM RESPONSE-PARA.

RESPONSE-PARA.
*> Utility function to get response from user
     DISPLAY WS-PROMPT-MSG WITH NO ADVANCING.
     ACCEPT WS-INPUT.
     IF WS-INPUT = "q" OR WS-INPUT = "Q" THEN
       MOVE 1 TO WS-QUIT.
